In [119]:
import pandas as pd
import json

In [124]:
TARGET_FIELDS = [
    'State Code',
    'FIPS County Code',
    'County Name',
    'Metal Level',
    'Issuer Name',
    # 'Premium Child Age 0-14',
    # 'Premium Child Age 18',
    'Premium Adult Individual Age 21',
    'Premium Adult Individual Age 27',
    'Premium Adult Individual Age 30 ',
    'Premium Adult Individual Age 40 ',
    'Premium Adult Individual Age 50 ',
    'Premium Adult Individual Age 60 ',
    'Individual+1 child, Age 21',
    'Individual+1 child, Age 30',
    'Individual+1 child, Age 40',
    'Individual+1 child, Age 50',
    'Individual+2 children, Age 21',
    'Individual+2 children, Age 30',
    'Individual+2 children, Age 40',
    'Individual+2 children, Age 50',
    'Individual+3 or more children, Age 21',
    'Individual+3 or more children, Age 30',
    'Individual+3 or more children, Age 40',
    'Individual+3 or more children, Age 50',
]

In [128]:
result_dict = {}
for yr in range(2017,2022):
    print(yr)
    df = pd.read_csv('insurance_plans/{}.csv'.format(yr))
    print(len(df))
    df_target = df[TARGET_FIELDS]
    temp =df.groupby(['State Code', 'Issuer Name']).size().to_frame('record_count')
    temp = temp.reset_index()
    

    state_df= temp.iloc[temp.groupby(['State Code'], sort=False)['record_count'].idxmax()][['State Code','Issuer Name','record_count']].reset_index(drop=True)
    state_df = state_df.merge(temp.groupby('State Code').sum(), left_on = 'State Code', right_on = 'State Code')
    state_df = state_df.set_index('State Code')

    display(state_df.head())
    result_dict[yr] = state_df.to_dict('index')
    # state_df.to_csv('insurance_plans/visualizations/state_mainissuer_{}.csv'.format(yr), index = False)



    break

2017
55581
C:\Users\dhh3hb\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (21) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

                                            Issuer Name  ...  record_count_y
State Code                                               ...
AK             Premera Blue Cross Blue Shield of Alaska  ...             145
AL                Blue Cross and Blue Shield of Alabama  ...             469
AR                      USAble Mutual Insurance Company  ...            1896
AZ          Blue Cross and Blue Shield of Arizona, Inc.  ...              72
DE                                  Highmark BCBSD Inc.  ...              60

[5 rows x 3 columns]

In [122]:
with open('insurance_plans/visualizations/state_mainissuer.json', 'w') as f:
    f.write(json.dumps(result_dict, indent = 4))

In [96]:
temp =df.groupby(['State Code', 'Issuer Name']).size().to_frame('count')
temp = temp.reset_index()
temp

    State Code                                       Issuer Name  count
0           AK          Premera Blue Cross Blue Shield of Alaska    145
1           AL             Blue Cross and Blue Shield of Alabama    469
2           AR                          Celtic Insurance Company    525
3           AR                             QCA Health Plan, Inc.    357
4           AR  QualChoice Life & Health Insurance Company, Inc.    114
..         ...                                               ...    ...
162         WI           Security Health Plan of Wisconsin, Inc.    616
163         WI          Unity Health Plans Insurance Corporation    483
164         WV                      CareSource West Virginia Co.    320
165         WV     Highmark Blue Cross Blue Shield West Virginia    385
166         WY                 Blue Cross Blue Shield of Wyoming    690

[167 rows x 3 columns]

In [98]:
temp.groupby('State Code').sum()

            count
State Code
AK            145
AL            469
AR           1896
AZ             72
DE             60
FL           2417
GA           3192
HI             92
IA           1326
IL           2572
IN           3630
KS           1272
KY           1455
LA           1097
ME            456
MI           3664
MO           1557
MS           1522
MT           1424
NC            990
ND           1108
NE           1051
NH            335
NJ            454
NM            751
NV            407
OH           3113
OK            994
OR            716
PA            782
SC           1196
SD           1200
TN            530
TX           4824
UT            397
VA           3583
WI           3437
WV            705
WY            690

In [130]:
TARGET_FIELDS

['State Code',
 'FIPS County Code',
 'County Name',
 'Metal Level',
 'Issuer Name',
 'Premium Adult Individual Age 21',
 'Premium Adult Individual Age 27',
 'Premium Adult Individual Age 30 ',
 'Premium Adult Individual Age 40 ',
 'Premium Adult Individual Age 50 ',
 'Premium Adult Individual Age 60 ',
 'Individual+1 child, Age 21',
 'Individual+1 child, Age 30',
 'Individual+1 child, Age 40',
 'Individual+1 child, Age 50',
 'Individual+2 children, Age 21',
 'Individual+2 children, Age 30',
 'Individual+2 children, Age 40',
 'Individual+2 children, Age 50',
 'Individual+3 or more children, Age 21',
 'Individual+3 or more children, Age 30',
 'Individual+3 or more children, Age 40',
 'Individual+3 or more children, Age 50']

In [156]:
premium_list = ['Premium Adult Individual Age 21',
 'Premium Adult Individual Age 27',
 'Premium Adult Individual Age 30 ',
 'Premium Adult Individual Age 40 ',
 'Premium Adult Individual Age 50 ',
 'Premium Adult Individual Age 60 ',
 'Individual+1 child, Age 21',
 'Individual+1 child, Age 30',
 'Individual+1 child, Age 40',
 'Individual+1 child, Age 50',
 'Individual+2 children, Age 21',
 'Individual+2 children, Age 30',
 'Individual+2 children, Age 40',
 'Individual+2 children, Age 50',
 'Individual+3 or more children, Age 21',
 'Individual+3 or more children, Age 30',
 'Individual+3 or more children, Age 40',
 'Individual+3 or more children, Age 50']
result_dict = {}
for yr in range(2017,2022):
    print(yr)
    df = pd.read_csv('insurance_plans/{}.csv'.format(yr))
    print(len(df))
    df_target = df[TARGET_FIELDS]
    temp =df.groupby(['State Code', 'Issuer Name']).size().to_frame('record_count')
    temp = temp.reset_index()
    

    # state_df= temp.iloc[temp.groupby(['State Code'], sort=False)['record_count'].idxmax()][['State Code','Issuer Name','record_count']].reset_index(drop=True)
    # state_df = state_df.merge(temp.groupby('State Code').sum(), left_on = 'State Code', right_on = 'State Code')
    # state_df = state_df.set_index('State Code')

    # display(state_df.head())
    # result_dict[yr] = state_df.to_dict('index')
    # state_df.to_csv('insurance_plans/visualizations/state_mainissuer_{}.csv'.format(yr), index = False)



    break
### TO DO HERE!

2017
55581
C:\Users\dhh3hb\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3146: DtypeWarning: Columns (21) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

<ipython-input-154-8b5ac9982f1d>:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp[typ] = temp[typ].str.replace('$', '')
<ipython-input-154-8b5ac9982f1d>:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp[typ] = temp[typ].str.replace(',', '')
<ipython-input-154-8b5ac9982f1d>:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp[typ] = temp[typ].astype(float)

In [155]:
temp

            Individual+3 or more children, Age 50
State Code
AK                                        3197.00
AK                                        2744.00
AK                                        2139.00
AK                                        2134.00
AK                                        2668.00
...                                           ...
WY                                        1775.11
WY                                        1573.98
WY                                        1371.13
WY                                        1158.49
WY                                        1513.18

[55581 rows x 1 columns]

In [136]:
temp

                                            record_count
State Code Premium Adult Individual Age 21
AK          $550.00                                    4
            $551.00                                    4
            $564.00                                    9
            $566.00                                    9
            $578.00                                   16
...                                                  ...
WY          $488.18                                   22
            $488.87                                   22
            $490.29                                   22
            $491.62                                   22
            $499.00                                   22

[10613 rows x 1 columns]